Revit 2027 API
AssemblyInstance.AllowsAssemblyViewCreation Method
 Returns true if assembly views can be created for this Assembly Instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsAssemblyViewCreation()
Public Function AllowsAssemblyViewCreation As Boolean
public:
bool AllowsAssemblyViewCreation()
member AllowsAssemblyViewCreation : unit -> bool
Return Value
Boolean
Remarks
 Assembly views are allowed when there are no assembly views for any instance of this type, or when the only existing assembly views belong to this instance
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace